iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H7B3_FreeRTOS_QEMU/iSYSTEM_sfr.h
  uint8_t res0[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PWAITEN:1;
      uint64_t PBKEN:1;
      uint64_t reservedSpace1:1;
      uint64_t PWID:2;
      uint64_t ECCEN:1;
      uint64_t reservedSpace2:2;
      uint64_t TCLR:4;
      uint64_t TAR:4;
      uint64_t ECCPS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRS:1;
      uint64_t ILS:1;
      uint64_t IFS:1;
      uint64_t IREN:1;
      uint64_t ILEN:1;
      uint64_t IFEN:1;
      uint64_t FEMPT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MEMSET:8;
      uint64_t MEMWAIT:8;
      uint64_t MEMHOLD:8;
      uint64_t MEMHIZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMEM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ATTSET:8;
      uint64_t ATTWAIT:8;
      uint64_t ATTHOLD:8;
      uint64_t ATTHIZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATT;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECCR;

  uint8_t res2[108];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDSET:4;
      uint64_t ADDHLD:4;
      uint64_t DATAST:8;
      uint64_t BUSTURN:4;
      uint64_t reservedSpace0:8;
      uint64_t ACCMOD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BWTR1;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDSET:4;
      uint64_t ADDHLD:4;
      uint64_t DATAST:8;
      uint64_t BUSTURN:4;
      uint64_t reservedSpace0:8;
      uint64_t ACCMOD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BWTR2;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDSET:4;
      uint64_t ADDHLD:4;
      uint64_t DATAST:8;
      uint64_t BUSTURN:4;
      uint64_t reservedSpace0:8;
      uint64_t ACCMOD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BWTR3;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDSET:4;
      uint64_t ADDHLD:4;
      uint64_t DATAST:8;
      uint64_t BUSTURN:4;
      uint64_t reservedSpace0:8;
      uint64_t ACCMOD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BWTR4;

  uint8_t res6[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NC:2;
      uint64_t NR:2;
      uint64_t MWID:2;
      uint64_t NB:1;
      uint64_t CAS:2;
      uint64_t WP:1;
      uint64_t SDCLK:2;
      uint64_t RBURST:1;
      uint64_t RPIPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NC:2;
      uint64_t NR:2;
      uint64_t MWID:2;
      uint64_t NB:1;
      uint64_t CAS:2;
      uint64_t WP:1;
      uint64_t SDCLK:2;
      uint64_t RBURST:1;
      uint64_t RPIPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMRD:4;
      uint64_t TXSR:4;
      uint64_t TRAS:4;
      uint64_t TRC:4;
      uint64_t TWR:4;
      uint64_t TRP:4;
      uint64_t TRCD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDTR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMRD:4;
      uint64_t TXSR:4;
      uint64_t TRAS:4;
      uint64_t TRC:4;
      uint64_t TWR:4;
      uint64_t TRP:4;
      uint64_t TRCD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDTR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t CTB2:1;
      uint64_t CTB1:1;
      uint64_t NRFS:4;
      uint64_t MRD:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDCMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRE:1;
      uint64_t COUNT:13;
      uint64_t REIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDRTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RE:1;
      uint64_t MODES1:2;
      uint64_t MODES2:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDSR;

};

#define FMC (*(volatile struct FMC_tag *) 0x52004000)

struct CEC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CECEN:1;
      uint64_t TXSOM:1;
      uint64_t TXEOM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SFT:3;
      uint64_t RXTOL:1;
      uint64_t BRESTP:1;
      uint64_t BREGEN:1;
      uint64_t LBPEGEN:1;
      uint64_t BRDNOGEN:1;
      uint64_t SFTOPT:1;
      uint64_t reservedSpace0:7;
      uint64_t OAR:15;
      uint64_t LSTN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXBR:1;
      uint64_t RXEND:1;
      uint64_t RXOVR:1;
      uint64_t BRE:1;
      uint64_t SBPE:1;
      uint64_t LBPE:1;
      uint64_t RXACKE:1;
      uint64_t ARBLST:1;
      uint64_t TXBR:1;
      uint64_t TXEND:1;
      uint64_t TXUDR:1;
      uint64_t TXERR:1;
      uint64_t TXACKE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXBRIE:1;
      uint64_t RXENDIE:1;
      uint64_t RXOVRIE:1;
      uint64_t BREIE:1;
      uint64_t SBPEIE:1;
      uint64_t LBPEIE:1;
      uint64_t RXACKIE:1;
      uint64_t ARBLSTIE:1;
      uint64_t TXBRIE:1;
      uint64_t TXENDIE:1;
      uint64_t TXUDRIE:1;
      uint64_t TXERRIE:1;
      uint64_t TXACKIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

