iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H7B3_FreeRTOS_QEMU/iSYSTEM_sfr.h
};

#define CEC (*(volatile struct CEC_tag *) 0x40006c00)

struct HSEM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t MASTERID:8;
      uint64_t reservedSpace0:15;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISEM0:1;
      uint64_t ISEM1:1;
      uint64_t ISEM2:1;
      uint64_t ISEM3:1;
      uint64_t ISEM4:1;
      uint64_t ISEM5:1;
      uint64_t ISEM6:1;
      uint64_t ISEM7:1;
      uint64_t ISEM8:1;
      uint64_t ISEM9:1;
      uint64_t ISEM10:1;
      uint64_t ISEM11:1;
      uint64_t ISEM12:1;
      uint64_t ISEM13:1;
      uint64_t ISEM14:1;
      uint64_t ISEM15:1;
      uint64_t ISEM16:1;
      uint64_t ISEM17:1;
      uint64_t ISEM18:1;
      uint64_t ISEM19:1;
      uint64_t ISEM20:1;
      uint64_t ISEM21:1;
      uint64_t ISEM22:1;
      uint64_t ISEM23:1;
      uint64_t ISEM24:1;
      uint64_t ISEM25:1;
      uint64_t ISEM26:1;
      uint64_t ISEM27:1;
      uint64_t ISEM28:1;
      uint64_t ISEM29:1;
      uint64_t ISEM30:1;
      uint64_t ISEM31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISEM0:1;
      uint64_t ISEM1:1;
      uint64_t ISEM2:1;
      uint64_t ISEM3:1;
      uint64_t ISEM4:1;
      uint64_t ISEM5:1;
      uint64_t ISEM6:1;
      uint64_t ISEM7:1;
      uint64_t ISEM8:1;
      uint64_t ISEM9:1;
      uint64_t ISEM10:1;
      uint64_t ISEM11:1;
      uint64_t ISEM12:1;
      uint64_t ISEM13:1;
      uint64_t ISEM14:1;
      uint64_t ISEM15:1;
      uint64_t ISEM16:1;
      uint64_t ISEM17:1;
      uint64_t ISEM18:1;
      uint64_t ISEM19:1;
      uint64_t ISEM20:1;
      uint64_t ISEM21:1;
      uint64_t ISEM22:1;
      uint64_t ISEM23:1;
      uint64_t ISEM24:1;
      uint64_t ISEM25:1;
      uint64_t ISEM26:1;
      uint64_t ISEM27:1;
      uint64_t ISEM28:1;
      uint64_t ISEM29:1;
      uint64_t ISEM30:1;
      uint64_t ISEM31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISEM0:1;
      uint64_t ISEM1:1;
      uint64_t ISEM2:1;
      uint64_t ISEM3:1;
      uint64_t ISEM4:1;
      uint64_t ISEM5:1;
      uint64_t ISEM6:1;
      uint64_t ISEM7:1;
      uint64_t ISEM8:1;
      uint64_t ISEM9:1;
      uint64_t ISEM10:1;
      uint64_t ISEM11:1;
      uint64_t ISEM12:1;
      uint64_t ISEM13:1;
      uint64_t ISEM14:1;
      uint64_t ISEM15:1;
      uint64_t ISEM16:1;
      uint64_t ISEM17:1;
      uint64_t ISEM18:1;
      uint64_t ISEM19:1;
      uint64_t ISEM20:1;
      uint64_t ISEM21:1;
      uint64_t ISEM22:1;
      uint64_t ISEM23:1;
      uint64_t ISEM24:1;
      uint64_t ISEM25:1;
      uint64_t ISEM26:1;
      uint64_t ISEM27:1;
      uint64_t ISEM28:1;
      uint64_t ISEM29:1;
      uint64_t ISEM30:1;
      uint64_t ISEM31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISEM0:1;
      uint64_t ISEM1:1;
      uint64_t ISEM2:1;
      uint64_t ISEM3:1;
      uint64_t ISEM4:1;
      uint64_t ISEM5:1;
      uint64_t ISEM6:1;
      uint64_t ISEM7:1;
      uint64_t ISEM8:1;
      uint64_t ISEM9:1;
      uint64_t ISEM10:1;
      uint64_t ISEM11:1;
      uint64_t ISEM12:1;
      uint64_t ISEM13:1;
      uint64_t ISEM14:1;
      uint64_t ISEM15:1;
      uint64_t ISEM16:1;
      uint64_t ISEM17:1;
      uint64_t ISEM18:1;
      uint64_t ISEM19:1;
      uint64_t ISEM20:1;
      uint64_t ISEM21:1;
      uint64_t ISEM22:1;
      uint64_t ISEM23:1;
      uint64_t ISEM24:1;
      uint64_t ISEM25:1;
      uint64_t ISEM26:1;
      uint64_t ISEM27:1;
      uint64_t ISEM28:1;
      uint64_t ISEM29:1;
      uint64_t ISEM30:1;
      uint64_t ISEM31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MISR;

  uint8_t res0[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t MASTERID:8;
      uint64_t KEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t KEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYR;

