iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H7B3_FreeRTOS_QEMU/iSYSTEM_sfr.h
  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C3MAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C3MDR;

  uint8_t res8[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEIF4:1;
      uint64_t CTCIF4:1;
      uint64_t BRTIF4:1;
      uint64_t BTIF4:1;
      uint64_t TCIF4:1;
      uint64_t reservedSpace0:11;
      uint64_t CRQA4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C4ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTEIF4:1;
      uint64_t CCTCIF4:1;
      uint64_t CBRTIF4:1;
      uint64_t CBTIF4:1;
      uint64_t CLTCIF4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C4IFCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEA:7;
      uint64_t TED:1;
      uint64_t TELD:1;
      uint64_t TEMD:1;
      uint64_t ASE:1;
      uint64_t BSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C4ESR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t TEIE:1;
      uint64_t CTCIE:1;
      uint64_t BRTIE:1;
      uint64_t BTIE:1;
      uint64_t TCIE:1;
      uint64_t PL:2;
      uint64_t reservedSpace0:4;
      uint64_t BEX:1;
      uint64_t HEX:1;
      uint64_t WEX:1;
      uint64_t reservedSpace1:1;
      uint64_t SWRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C4CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SINC:2;
      uint64_t DINC:2;
      uint64_t SSIZE:2;
      uint64_t DSIZE:2;
      uint64_t SINCOS:2;
      uint64_t DINCOS:2;
      uint64_t SBURST:3;
      uint64_t DBURST:3;
      uint64_t TLEN:7;
      uint64_t PKE:1;
      uint64_t PAM:2;
      uint64_t TRGM:2;
      uint64_t SWRM:1;
      uint64_t BWM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C4TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BNDT:17;
      uint64_t reservedSpace0:1;
      uint64_t BRSUM:1;
      uint64_t BRDUM:1;
      uint64_t BRC:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C4BNDTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C4SAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C4DAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUV:16;
      uint64_t DUV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C4BRUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C4LAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSEL:6;
      uint64_t reservedSpace0:10;
      uint64_t SBUS:1;
      uint64_t DBUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C4TBR;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C4MAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C4MDR;

  uint8_t res10[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEIF5:1;
      uint64_t CTCIF5:1;
      uint64_t BRTIF5:1;
      uint64_t BTIF5:1;
      uint64_t TCIF5:1;
      uint64_t reservedSpace0:11;
      uint64_t CRQA5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C5ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTEIF5:1;
      uint64_t CCTCIF5:1;
      uint64_t CBRTIF5:1;
      uint64_t CBTIF5:1;
      uint64_t CLTCIF5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C5IFCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEA:7;
      uint64_t TED:1;
      uint64_t TELD:1;
      uint64_t TEMD:1;
      uint64_t ASE:1;
      uint64_t BSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C5ESR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t TEIE:1;
      uint64_t CTCIE:1;
      uint64_t BRTIE:1;
      uint64_t BTIE:1;
      uint64_t TCIE:1;
      uint64_t PL:2;
      uint64_t reservedSpace0:4;
      uint64_t BEX:1;
      uint64_t HEX:1;
      uint64_t WEX:1;
      uint64_t reservedSpace1:1;
      uint64_t SWRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C5CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SINC:2;
      uint64_t DINC:2;
      uint64_t SSIZE:2;
      uint64_t DSIZE:2;
      uint64_t SINCOS:2;
      uint64_t DINCOS:2;
      uint64_t SBURST:3;
      uint64_t DBURST:3;
      uint64_t TLEN:7;
      uint64_t PKE:1;
      uint64_t PAM:2;
      uint64_t TRGM:2;
      uint64_t SWRM:1;
      uint64_t BWM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C5TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BNDT:17;
      uint64_t reservedSpace0:1;
      uint64_t BRSUM:1;
      uint64_t BRDUM:1;
      uint64_t BRC:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C5BNDTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C5SAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C5DAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUV:16;
      uint64_t DUV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C5BRUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C5LAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSEL:6;
      uint64_t reservedSpace0:10;
      uint64_t SBUS:1;
      uint64_t DBUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C5TBR;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C5MAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C5MDR;

  uint8_t res12[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEIF6:1;
      uint64_t CTCIF6:1;
      uint64_t BRTIF6:1;
      uint64_t BTIF6:1;
      uint64_t TCIF6:1;
      uint64_t reservedSpace0:11;
      uint64_t CRQA6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C6ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTEIF6:1;
      uint64_t CCTCIF6:1;
      uint64_t CBRTIF6:1;
      uint64_t CBTIF6:1;
      uint64_t CLTCIF6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C6IFCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEA:7;
      uint64_t TED:1;
      uint64_t TELD:1;
      uint64_t TEMD:1;
      uint64_t ASE:1;
      uint64_t BSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C6ESR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t TEIE:1;
      uint64_t CTCIE:1;
      uint64_t BRTIE:1;
      uint64_t BTIE:1;
      uint64_t TCIE:1;
      uint64_t PL:2;
      uint64_t reservedSpace0:4;
      uint64_t BEX:1;
      uint64_t HEX:1;
      uint64_t WEX:1;
      uint64_t reservedSpace1:1;
      uint64_t SWRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C6CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SINC:2;
      uint64_t DINC:2;
      uint64_t SSIZE:2;
      uint64_t DSIZE:2;
      uint64_t SINCOS:2;
      uint64_t DINCOS:2;
      uint64_t SBURST:3;
      uint64_t DBURST:3;
      uint64_t TLEN:7;
      uint64_t PKE:1;
      uint64_t PAM:2;
      uint64_t TRGM:2;
      uint64_t SWRM:1;
      uint64_t BWM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C6TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BNDT:17;
      uint64_t reservedSpace0:1;
      uint64_t BRSUM:1;
      uint64_t BRDUM:1;
      uint64_t BRC:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C6BNDTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C6SAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C6DAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUV:16;
      uint64_t DUV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C6BRUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C6LAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSEL:6;
      uint64_t reservedSpace0:10;
      uint64_t SBUS:1;
      uint64_t DBUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C6TBR;

  uint8_t res13[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C6MAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C6MDR;

  uint8_t res14[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEIF7:1;
      uint64_t CTCIF7:1;
      uint64_t BRTIF7:1;
      uint64_t BTIF7:1;
      uint64_t TCIF7:1;
      uint64_t reservedSpace0:11;
      uint64_t CRQA7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C7ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTEIF7:1;
      uint64_t CCTCIF7:1;
      uint64_t CBRTIF7:1;
      uint64_t CBTIF7:1;
      uint64_t CLTCIF7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C7IFCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEA:7;
      uint64_t TED:1;
      uint64_t TELD:1;
      uint64_t TEMD:1;
      uint64_t ASE:1;
      uint64_t BSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C7ESR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t TEIE:1;
      uint64_t CTCIE:1;
      uint64_t BRTIE:1;
      uint64_t BTIE:1;
      uint64_t TCIE:1;
      uint64_t PL:2;
      uint64_t reservedSpace0:4;
      uint64_t BEX:1;
      uint64_t HEX:1;
      uint64_t WEX:1;
      uint64_t reservedSpace1:1;
      uint64_t SWRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C7CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SINC:2;
      uint64_t DINC:2;
      uint64_t SSIZE:2;
      uint64_t DSIZE:2;
      uint64_t SINCOS:2;
      uint64_t DINCOS:2;
      uint64_t SBURST:3;
      uint64_t DBURST:3;
      uint64_t TLEN:7;
      uint64_t PKE:1;
      uint64_t PAM:2;
      uint64_t TRGM:2;
      uint64_t SWRM:1;
      uint64_t BWM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C7TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BNDT:17;
      uint64_t reservedSpace0:1;
      uint64_t BRSUM:1;
      uint64_t BRDUM:1;
      uint64_t BRC:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C7BNDTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C7SAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C7DAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUV:16;
      uint64_t DUV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C7BRUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C7LAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSEL:6;
      uint64_t reservedSpace0:10;
      uint64_t SBUS:1;
      uint64_t DBUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C7TBR;

  uint8_t res15[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C7MAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C7MDR;

  uint8_t res16[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEIF8:1;
      uint64_t CTCIF8:1;
      uint64_t BRTIF8:1;
      uint64_t BTIF8:1;
      uint64_t TCIF8:1;
      uint64_t reservedSpace0:11;
      uint64_t CRQA8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C8ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTEIF8:1;
      uint64_t CCTCIF8:1;
      uint64_t CBRTIF8:1;
      uint64_t CBTIF8:1;
      uint64_t CLTCIF8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C8IFCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEA:7;
      uint64_t TED:1;
      uint64_t TELD:1;
      uint64_t TEMD:1;
      uint64_t ASE:1;
      uint64_t BSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C8ESR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t TEIE:1;
      uint64_t CTCIE:1;
      uint64_t BRTIE:1;
      uint64_t BTIE:1;
      uint64_t TCIE:1;
      uint64_t PL:2;
      uint64_t reservedSpace0:4;
      uint64_t BEX:1;
      uint64_t HEX:1;
      uint64_t WEX:1;
      uint64_t reservedSpace1:1;
      uint64_t SWRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C8CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SINC:2;
      uint64_t DINC:2;
      uint64_t SSIZE:2;
      uint64_t DSIZE:2;
      uint64_t SINCOS:2;
      uint64_t DINCOS:2;
      uint64_t SBURST:3;
      uint64_t DBURST:3;
      uint64_t TLEN:7;
      uint64_t PKE:1;
      uint64_t PAM:2;
      uint64_t TRGM:2;
      uint64_t SWRM:1;
      uint64_t BWM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C8TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BNDT:17;
      uint64_t reservedSpace0:1;
      uint64_t BRSUM:1;
      uint64_t BRDUM:1;
      uint64_t BRC:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C8BNDTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C8SAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C8DAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUV:16;
      uint64_t DUV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C8BRUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C8LAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSEL:6;
      uint64_t reservedSpace0:10;
      uint64_t SBUS:1;
      uint64_t DBUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C8TBR;

  uint8_t res17[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C8MAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C8MDR;

  uint8_t res18[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEIF9:1;
      uint64_t CTCIF9:1;
      uint64_t BRTIF9:1;
      uint64_t BTIF9:1;
      uint64_t TCIF9:1;
      uint64_t reservedSpace0:11;
      uint64_t CRQA9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C9ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTEIF9:1;
      uint64_t CCTCIF9:1;
      uint64_t CBRTIF9:1;
      uint64_t CBTIF9:1;
      uint64_t CLTCIF9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C9IFCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEA:7;
      uint64_t TED:1;
      uint64_t TELD:1;
      uint64_t TEMD:1;
      uint64_t ASE:1;
      uint64_t BSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C9ESR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t TEIE:1;
      uint64_t CTCIE:1;
      uint64_t BRTIE:1;
      uint64_t BTIE:1;
      uint64_t TCIE:1;
      uint64_t PL:2;
      uint64_t reservedSpace0:4;
      uint64_t BEX:1;
      uint64_t HEX:1;
      uint64_t WEX:1;
      uint64_t reservedSpace1:1;
      uint64_t SWRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C9CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SINC:2;
      uint64_t DINC:2;
      uint64_t SSIZE:2;
      uint64_t DSIZE:2;
      uint64_t SINCOS:2;
      uint64_t DINCOS:2;
      uint64_t SBURST:3;
      uint64_t DBURST:3;
      uint64_t TLEN:7;
      uint64_t PKE:1;
      uint64_t PAM:2;
      uint64_t TRGM:2;
      uint64_t SWRM:1;
      uint64_t BWM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C9TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BNDT:17;
      uint64_t reservedSpace0:1;
      uint64_t BRSUM:1;
      uint64_t BRDUM:1;
      uint64_t BRC:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C9BNDTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C9SAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C9DAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUV:16;
      uint64_t DUV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C9BRUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C9LAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSEL:6;
      uint64_t reservedSpace0:10;
      uint64_t SBUS:1;
      uint64_t DBUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C9TBR;

  uint8_t res19[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C9MAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C9MDR;

  uint8_t res20[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEIF10:1;
      uint64_t CTCIF10:1;
      uint64_t BRTIF10:1;
      uint64_t BTIF10:1;
      uint64_t TCIF10:1;
      uint64_t reservedSpace0:11;
      uint64_t CRQA10:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C10ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTEIF10:1;
      uint64_t CCTCIF10:1;
      uint64_t CBRTIF10:1;
      uint64_t CBTIF10:1;
      uint64_t CLTCIF10:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C10IFCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEA:7;
      uint64_t TED:1;
      uint64_t TELD:1;
      uint64_t TEMD:1;
      uint64_t ASE:1;
      uint64_t BSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C10ESR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t TEIE:1;
      uint64_t CTCIE:1;
      uint64_t BRTIE:1;
      uint64_t BTIE:1;
      uint64_t TCIE:1;
      uint64_t PL:2;
      uint64_t reservedSpace0:4;
      uint64_t BEX:1;
      uint64_t HEX:1;
      uint64_t WEX:1;
      uint64_t reservedSpace1:1;
      uint64_t SWRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C10CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SINC:2;
      uint64_t DINC:2;
      uint64_t SSIZE:2;
      uint64_t DSIZE:2;
      uint64_t SINCOS:2;
      uint64_t DINCOS:2;
      uint64_t SBURST:3;
      uint64_t DBURST:3;
      uint64_t TLEN:7;
      uint64_t PKE:1;
      uint64_t PAM:2;
      uint64_t TRGM:2;
      uint64_t SWRM:1;
      uint64_t BWM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C10TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BNDT:17;
      uint64_t reservedSpace0:1;
      uint64_t BRSUM:1;
      uint64_t BRDUM:1;
      uint64_t BRC:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C10BNDTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C10SAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C10DAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUV:16;
      uint64_t DUV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C10BRUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C10LAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSEL:6;
      uint64_t reservedSpace0:10;
      uint64_t SBUS:1;
      uint64_t DBUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C10TBR;

  uint8_t res21[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C10MAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C10MDR;

  uint8_t res22[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEIF11:1;
      uint64_t CTCIF11:1;
      uint64_t BRTIF11:1;
      uint64_t BTIF11:1;
      uint64_t TCIF11:1;
      uint64_t reservedSpace0:11;
      uint64_t CRQA11:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C11ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTEIF11:1;
      uint64_t CCTCIF11:1;
      uint64_t CBRTIF11:1;
      uint64_t CBTIF11:1;
      uint64_t CLTCIF11:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C11IFCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEA:7;
      uint64_t TED:1;
      uint64_t TELD:1;
      uint64_t TEMD:1;
      uint64_t ASE:1;
      uint64_t BSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C11ESR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t TEIE:1;
      uint64_t CTCIE:1;
      uint64_t BRTIE:1;
      uint64_t BTIE:1;
      uint64_t TCIE:1;
      uint64_t PL:2;
      uint64_t reservedSpace0:4;
      uint64_t BEX:1;
      uint64_t HEX:1;
      uint64_t WEX:1;
      uint64_t reservedSpace1:1;
      uint64_t SWRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C11CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SINC:2;
      uint64_t DINC:2;
      uint64_t SSIZE:2;
      uint64_t DSIZE:2;
      uint64_t SINCOS:2;
      uint64_t DINCOS:2;
      uint64_t SBURST:3;
      uint64_t DBURST:3;
      uint64_t TLEN:7;
      uint64_t PKE:1;
      uint64_t PAM:2;
      uint64_t TRGM:2;
      uint64_t SWRM:1;
      uint64_t BWM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C11TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BNDT:17;
      uint64_t reservedSpace0:1;
      uint64_t BRSUM:1;
      uint64_t BRDUM:1;
      uint64_t BRC:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C11BNDTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C11SAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C11DAR;

