iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H7B3_FreeRTOS_QEMU/iSYSTEM_sfr.h
};

#define SDMMC1 (*(volatile struct SDMMC1_tag *) 0x52007000)

struct SDMMC2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWRCTRL:2;
      uint64_t VSWITCH:1;
      uint64_t VSWITCHEN:1;
      uint64_t DIRPOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDMMC_POWER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKDIV:10;
      uint64_t reservedSpace0:2;
      uint64_t PWRSAV:1;
      uint64_t reservedSpace1:1;
      uint64_t WIDBUS:2;
      uint64_t NEGEDGE:1;
      uint64_t HWFC_EN:1;
      uint64_t DDR:1;
      uint64_t BUSSPEED:1;
      uint64_t SELCLKRX:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDMMC_CLKCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDARG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDMMC_ARGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDINDEX:6;
      uint64_t CMDTRANS:1;
      uint64_t CMDSTOP:1;
      uint64_t WAITRESP:2;
      uint64_t WAITINT:1;
      uint64_t WAITPEND:1;
      uint64_t CPSMEN:1;
      uint64_t DTHOLD:1;
      uint64_t BOOTMODE:1;
      uint64_t BOOTEN:1;
      uint64_t CMDSUSPEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDMMC_CMDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESPCMD:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDMMC_RESPCMDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CARDSTATUS1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDMMC_RESP1R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CARDSTATUS2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDMMC_RESP2R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CARDSTATUS3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDMMC_RESP3R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CARDSTATUS4:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDMMC_RESP4R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATATIME:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDMMC_DTIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATALENGTH:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDMMC_DLENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTEN:1;
      uint64_t DTDIR:1;
      uint64_t DTMODE:2;
      uint64_t DBLOCKSIZE:4;
      uint64_t RWSTART:1;
      uint64_t RWSTOP:1;
      uint64_t RWMOD:1;
      uint64_t SDIOEN:1;
      uint64_t BOOTACKEN:1;
      uint64_t FIFORST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDMMC_DCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATACOUNT:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDMMC_DCNTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCRCFAIL:1;
      uint64_t DCRCFAIL:1;
      uint64_t CTIMEOUT:1;
      uint64_t DTIMEOUT:1;
      uint64_t TXUNDERR:1;
      uint64_t RXOVERR:1;
      uint64_t CMDREND:1;
      uint64_t CMDSENT:1;
      uint64_t DATAEND:1;
      uint64_t DHOLD:1;
      uint64_t DBCKEND:1;
      uint64_t DABORT:1;
      uint64_t DPSMACT:1;
      uint64_t CPSMACT:1;
      uint64_t TXFIFOHE:1;
      uint64_t RXFIFOHF:1;
      uint64_t TXFIFOF:1;
      uint64_t RXFIFOF:1;
      uint64_t TXFIFOE:1;
      uint64_t RXFIFOE:1;
      uint64_t BUSYD0:1;
      uint64_t BUSYD0END:1;
      uint64_t SDIOIT:1;
      uint64_t ACKFAIL:1;
      uint64_t ACKTIMEOUT:1;
      uint64_t VSWEND:1;
      uint64_t CKSTOP:1;
      uint64_t IDMATE:1;
      uint64_t IDMABTC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDMMC_STAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCRCFAILC:1;
      uint64_t DCRCFAILC:1;
      uint64_t CTIMEOUTC:1;
      uint64_t DTIMEOUTC:1;
      uint64_t TXUNDERRC:1;
      uint64_t RXOVERRC:1;
      uint64_t CMDRENDC:1;
      uint64_t CMDSENTC:1;
      uint64_t DATAENDC:1;
      uint64_t DHOLDC:1;
      uint64_t DBCKENDC:1;
      uint64_t DABORTC:1;
      uint64_t reservedSpace0:9;
      uint64_t BUSYD0ENDC:1;
      uint64_t SDIOITC:1;
      uint64_t ACKFAILC:1;
      uint64_t ACKTIMEOUTC:1;
      uint64_t VSWENDC:1;
      uint64_t CKSTOPC:1;
      uint64_t IDMATEC:1;
      uint64_t IDMABTCC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDMMC_ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCRCFAILIE:1;
      uint64_t DCRCFAILIE:1;
      uint64_t CTIMEOUTIE:1;
      uint64_t DTIMEOUTIE:1;
      uint64_t TXUNDERRIE:1;
      uint64_t RXOVERRIE:1;
      uint64_t CMDRENDIE:1;
      uint64_t CMDSENTIE:1;
      uint64_t DATAENDIE:1;
      uint64_t DHOLDIE:1;
      uint64_t DBCKENDIE:1;
      uint64_t DABORTIE:1;
      uint64_t reservedSpace0:2;
      uint64_t TXFIFOHEIE:1;
      uint64_t RXFIFOHFIE:1;
      uint64_t reservedSpace1:1;
      uint64_t RXFIFOFIE:1;
      uint64_t TXFIFOEIE:1;
      uint64_t reservedSpace2:2;
      uint64_t BUSYD0ENDIE:1;
      uint64_t SDIOITIE:1;
      uint64_t ACKFAILIE:1;
      uint64_t ACKTIMEOUTIE:1;
      uint64_t VSWENDIE:1;
      uint64_t CKSTOPIE:1;
      uint64_t reservedSpace3:1;
      uint64_t IDMABTCIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDMMC_MASKR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACKTIME:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDMMC_ACKTIMER;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDMAEN:1;
      uint64_t IDMABMODE:1;
      uint64_t IDMABACT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDMMC_IDMACTRLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t IDMABNDT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDMMC_IDMABSIZER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDMABASE0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDMMC_IDMABASE0R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDMABASE1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDMMC_IDMABASE1R;

  uint8_t res1[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIFODATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDMMC_FIFOR;

  uint8_t res2[880];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINREV:4;
      uint64_t MAJREV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDMMC_VER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IP_ID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDMMC_ID;

