iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H7B3_FreeRTOS_QEMU/iSYSTEM_sfr.h
};

#define SDMMC2 (*(volatile struct SDMMC2_tag *) 0x48022400)

struct VREFBUF_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENVR:1;
      uint64_t HIZ:1;
      uint64_t reservedSpace0:1;
      uint64_t VRR:1;
      uint64_t VRS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VREFBUF_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIM:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VREFBUF_CCR;

};

#define VREFBUF (*(volatile struct VREFBUF_tag *) 0x58003c00)

struct IWDG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IWDG_KR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IWDG_PR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RL:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IWDG_RLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PVU:1;
      uint64_t RVU:1;
      uint64_t WVU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IWDG_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WIN:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IWDG_WINR;

};

#define IWDG (*(volatile struct IWDG_tag *) 0x58004800)

struct WWDG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t T:7;
      uint64_t WDGA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WWDG_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t W:7;
      uint64_t reservedSpace0:2;
      uint64_t EWI:1;
      uint64_t reservedSpace1:1;
      uint64_t WDGTB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WWDG_CFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EWIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WWDG_SR;

};

#define WWDG (*(volatile struct WWDG_tag *) 0x50003000)

struct PWR_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPDS:1;
      uint64_t reservedSpace0:3;
      uint64_t PVDE:1;
      uint64_t PLS:3;
      uint64_t DBP:1;
      uint64_t FLPS:1;
      uint64_t reservedSpace1:4;
      uint64_t SVOS:2;
      uint64_t AVDEN:1;
      uint64_t ALS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PVDO:1;
      uint64_t reservedSpace1:8;
      uint64_t ACTVOSRDY:1;
      uint64_t ACTVOS:2;
      uint64_t AVDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_CSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BREN:1;
      uint64_t reservedSpace0:3;
      uint64_t MONEN:1;
      uint64_t reservedSpace1:11;
      uint64_t BRRDY:1;
      uint64_t reservedSpace2:3;
      uint64_t VBATL:1;
      uint64_t VBATH:1;
      uint64_t TEMPL:1;
      uint64_t TEMPH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BYPASS:1;
      uint64_t LDOEN:1;
      uint64_t SDEN:1;
      uint64_t reservedSpace0:5;
      uint64_t VBE:1;
      uint64_t VBRS:1;
      uint64_t reservedSpace1:14;
      uint64_t USB33DEN:1;
      uint64_t USBREGEN:1;
      uint64_t USB33RDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_CR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDDS_D1:1;
      uint64_t PDDS_D2:1;
      uint64_t PDDS_D3:1;
      uint64_t reservedSpace0:2;
      uint64_t STOPF:1;
      uint64_t SBF:1;
      uint64_t SBF_D1:1;
      uint64_t SBF_D2:1;
      uint64_t CSSF:1;
      uint64_t reservedSpace1:1;
      uint64_t RUN_D3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_CPUCR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:13;
      uint64_t VOSRDY:1;
      uint64_t VOS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_D3CR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUPC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_WKUPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUPF1:1;
      uint64_t WKUPF2:1;
      uint64_t WKUPF3:1;
      uint64_t WKUPF4:1;
      uint64_t WKUPF5:1;
      uint64_t WKUPF6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_WKUPFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUPEN1:1;
      uint64_t WKUPEN2:1;
      uint64_t WKUPEN3:1;
      uint64_t WKUPEN4:1;
      uint64_t WKUPEN5:1;
      uint64_t WKUPEN6:1;
      uint64_t reservedSpace0:2;
      uint64_t WKUPP1:1;
      uint64_t WKUPP2:1;
      uint64_t WKUPP3:1;
      uint64_t WKUPP4:1;
      uint64_t WKUPP5:1;
      uint64_t WKUPP6:1;
      uint64_t reservedSpace1:2;
      uint64_t WKUPPUPD1:2;
      uint64_t WKUPPUPD2:2;
      uint64_t WKUPPUPD3:2;
      uint64_t WKUPPUPD4:2;
      uint64_t WKUPPUPD5:2;
      uint64_t WKUPPUPD6:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_WKUPEPR;

};

#define PWR (*(volatile struct PWR_tag *) 0x58024800)

struct SPI1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPE:1;
      uint64_t reservedSpace0:7;
      uint64_t MASRX:1;
      uint64_t CSTART:1;
      uint64_t CSUSP:1;
      uint64_t HDDIR:1;
      uint64_t SSI:1;
      uint64_t CRC33_17:1;
      uint64_t RCRCI:1;
      uint64_t TCRCI:1;
      uint64_t IOLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSIZE:16;
      uint64_t TSER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSIZE:5;
      uint64_t FTHVL:4;
      uint64_t UDRCFG:2;
      uint64_t UDRDET:2;
      uint64_t reservedSpace0:1;
      uint64_t RXDMAEN:1;
      uint64_t TXDMAEN:1;
      uint64_t CRCSIZE:5;
      uint64_t reservedSpace1:1;
      uint64_t CRCEN:1;
      uint64_t reservedSpace2:5;
      uint64_t MBR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSSI:4;
      uint64_t MIDI:4;
      uint64_t reservedSpace0:7;
      uint64_t IOSWP:1;
      uint64_t reservedSpace1:1;
      uint64_t COMM:2;
      uint64_t SP:3;
      uint64_t MASTER:1;
      uint64_t LSBFRST:1;
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t SSM:1;
      uint64_t reservedSpace2:1;
      uint64_t SSIOP:1;
      uint64_t SSOE:1;
      uint64_t SSOM:1;
      uint64_t AFCNTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPIE:1;
      uint64_t TXPIE:1;
      uint64_t DPXPIE:1;
      uint64_t EOTIE:1;
      uint64_t TXTFIE:1;
      uint64_t UDRIE:1;
      uint64_t OVRIE:1;
      uint64_t CRCEIE:1;
      uint64_t TIFREIE:1;
      uint64_t MODFIE:1;
      uint64_t TSERFIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXP:1;
      uint64_t TXP:1;
      uint64_t DXP:1;
      uint64_t EOT:1;
      uint64_t TXTF:1;
      uint64_t UDR:1;
      uint64_t OVR:1;
      uint64_t CRCE:1;
      uint64_t TIFRE:1;
      uint64_t MODF:1;
      uint64_t TSERF:1;
      uint64_t SUSP:1;
      uint64_t TXC:1;
      uint64_t RXPLVL:2;
      uint64_t RXWNE:1;
      uint64_t CTSIZE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t EOTC:1;
      uint64_t TXTFC:1;
      uint64_t UDRC:1;
      uint64_t OVRC:1;
      uint64_t CRCEC:1;
      uint64_t TIFREC:1;
      uint64_t MODFC:1;
      uint64_t TSERFC:1;
      uint64_t SUSPC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFCR;

