iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H7B3_FreeRTOS_QEMU/iSYSTEM_sfr.h
  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JL:2;
      uint64_t JEXTSEL:5;
      uint64_t JEXTEN:2;
      uint64_t JSQ1:5;
      uint64_t reservedSpace0:1;
      uint64_t JSQ2:5;
      uint64_t reservedSpace1:1;
      uint64_t JSQ3:5;
      uint64_t reservedSpace2:1;
      uint64_t JSQ4:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JSQR;

  uint8_t res2[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFSET1:26;
      uint64_t OFFSET1_CH:5;
      uint64_t SSATE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OFR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFSET1:26;
      uint64_t OFFSET1_CH:5;
      uint64_t SSATE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OFR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFSET1:26;
      uint64_t OFFSET1_CH:5;
      uint64_t SSATE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OFR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFSET1:26;
      uint64_t OFFSET1_CH:5;
      uint64_t SSATE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OFR4;

  uint8_t res3[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JDATA1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JDATA2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JDATA3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JDR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JDATA4:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JDR4;

  uint8_t res4[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AWD2CH:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AWD2CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t AWD3CH:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AWD3CR;

  uint8_t res5[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LTR2:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LTR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTR2:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LTR3:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LTR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTR3:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIFSEL:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIFSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CALFACT_S:11;
      uint64_t reservedSpace0:5;
      uint64_t CALFACT_D:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CALFACT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINCALFACT:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CALFACT2;

};

#define ADC2 (*(volatile struct ADC2_tag *) 0x40022100)

struct ADC12_Common_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADRDY_MST:1;
      uint64_t EOSMP_MST:1;
      uint64_t EOC_MST:1;
      uint64_t EOS_MST:1;
      uint64_t OVR_MST:1;
      uint64_t JEOC_MST:1;
      uint64_t JEOS_MST:1;
      uint64_t AWD1_MST:1;
      uint64_t AWD2_MST:1;
      uint64_t AWD3_MST:1;
      uint64_t JQOVF_MST:1;
      uint64_t reservedSpace0:5;
      uint64_t ADRDY_SLV:1;
      uint64_t EOSMP_SLV:1;
      uint64_t EOC_SLV:1;
      uint64_t EOS_SLV:1;
      uint64_t OVR_SLV:1;
      uint64_t JEOC_SLV:1;
      uint64_t JEOS_SLV:1;
      uint64_t AWD1_SLV:1;
      uint64_t AWD2_SLV:1;
      uint64_t AWD3_SLV:1;
      uint64_t JQOVF_SLV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DUAL:5;
      uint64_t reservedSpace0:3;
      uint64_t DELAY:4;
      uint64_t reservedSpace1:2;
      uint64_t DAMDF:2;
      uint64_t CKMODE:2;
      uint64_t PRESC:4;
      uint64_t VREFEN:1;
      uint64_t VSENSEEN:1;
      uint64_t VBATEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDATA_MST:16;
      uint64_t RDATA_SLV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR;

};

#define ADC12_Common (*(volatile struct ADC12_Common_tag *) 0x40022300)

struct DMAMUX1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAREQ_ID:8;
      uint64_t SOIE:1;
      uint64_t EGE:1;
      uint64_t reservedSpace0:6;
      uint64_t SE:1;
      uint64_t SPOL:2;
      uint64_t NBREQ:5;
      uint64_t SYNC_ID:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAMUX1_C0CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAREQ_ID:8;
      uint64_t SOIE:1;
      uint64_t EGE:1;
      uint64_t reservedSpace0:6;
      uint64_t SE:1;
      uint64_t SPOL:2;
      uint64_t NBREQ:5;
      uint64_t SYNC_ID:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAMUX1_C1CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAREQ_ID:8;
      uint64_t SOIE:1;
      uint64_t EGE:1;
      uint64_t reservedSpace0:6;
      uint64_t SE:1;
      uint64_t SPOL:2;
      uint64_t NBREQ:5;
      uint64_t SYNC_ID:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAMUX1_C2CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAREQ_ID:8;
      uint64_t SOIE:1;
      uint64_t EGE:1;
      uint64_t reservedSpace0:6;
      uint64_t SE:1;
      uint64_t SPOL:2;
      uint64_t NBREQ:5;
      uint64_t SYNC_ID:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAMUX1_C3CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAREQ_ID:8;
      uint64_t SOIE:1;
      uint64_t EGE:1;
      uint64_t reservedSpace0:6;
      uint64_t SE:1;
      uint64_t SPOL:2;
      uint64_t NBREQ:5;
      uint64_t SYNC_ID:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAMUX1_C4CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAREQ_ID:8;
      uint64_t SOIE:1;
      uint64_t EGE:1;
      uint64_t reservedSpace0:6;
      uint64_t SE:1;
      uint64_t SPOL:2;
      uint64_t NBREQ:5;
      uint64_t SYNC_ID:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAMUX1_C5CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAREQ_ID:8;
      uint64_t SOIE:1;
      uint64_t EGE:1;
      uint64_t reservedSpace0:6;
      uint64_t SE:1;
      uint64_t SPOL:2;
      uint64_t NBREQ:5;
      uint64_t SYNC_ID:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAMUX1_C6CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAREQ_ID:8;
      uint64_t SOIE:1;
      uint64_t EGE:1;
      uint64_t reservedSpace0:6;
      uint64_t SE:1;
      uint64_t SPOL:2;
      uint64_t NBREQ:5;
      uint64_t SYNC_ID:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAMUX1_C7CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAREQ_ID:8;
      uint64_t SOIE:1;
      uint64_t EGE:1;
      uint64_t reservedSpace0:6;
      uint64_t SE:1;
      uint64_t SPOL:2;
      uint64_t NBREQ:5;
      uint64_t SYNC_ID:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAMUX1_C8CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAREQ_ID:8;
      uint64_t SOIE:1;
      uint64_t EGE:1;
      uint64_t reservedSpace0:6;
      uint64_t SE:1;
      uint64_t SPOL:2;
      uint64_t NBREQ:5;
      uint64_t SYNC_ID:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAMUX1_C9CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAREQ_ID:8;
      uint64_t SOIE:1;
      uint64_t EGE:1;
      uint64_t reservedSpace0:6;
      uint64_t SE:1;
      uint64_t SPOL:2;
      uint64_t NBREQ:5;
      uint64_t SYNC_ID:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAMUX1_C10CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAREQ_ID:8;
      uint64_t SOIE:1;
      uint64_t EGE:1;
      uint64_t reservedSpace0:6;
      uint64_t SE:1;
      uint64_t SPOL:2;
      uint64_t NBREQ:5;
      uint64_t SYNC_ID:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAMUX1_C11CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAREQ_ID:8;
      uint64_t SOIE:1;
      uint64_t EGE:1;
      uint64_t reservedSpace0:6;
      uint64_t SE:1;
      uint64_t SPOL:2;
      uint64_t NBREQ:5;
      uint64_t SYNC_ID:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAMUX1_C12CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAREQ_ID:8;
      uint64_t SOIE:1;
      uint64_t EGE:1;
      uint64_t reservedSpace0:6;
      uint64_t SE:1;
      uint64_t SPOL:2;
      uint64_t NBREQ:5;
      uint64_t SYNC_ID:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAMUX1_C13CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAREQ_ID:8;
      uint64_t SOIE:1;
      uint64_t EGE:1;
      uint64_t reservedSpace0:6;
      uint64_t SE:1;
      uint64_t SPOL:2;
      uint64_t NBREQ:5;
      uint64_t SYNC_ID:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAMUX1_C14CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAREQ_ID:8;
      uint64_t SOIE:1;
      uint64_t EGE:1;
      uint64_t reservedSpace0:6;
      uint64_t SE:1;
      uint64_t SPOL:2;
      uint64_t NBREQ:5;
      uint64_t SYNC_ID:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAMUX1_C15CR;

