iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H7B3_FreeRTOS_QEMU/iSYSTEM_sfr.h
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLLSRC:2;
      uint64_t reservedSpace0:2;
      uint64_t DIVM1:6;
      uint64_t reservedSpace1:2;
      uint64_t DIVM2:6;
      uint64_t reservedSpace2:2;
      uint64_t DIVM3:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLCKSELR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLL1FRACEN:1;
      uint64_t PLL1VCOSEL:1;
      uint64_t PLL1RGE:2;
      uint64_t PLL2FRACEN:1;
      uint64_t PLL2VCOSEL:1;
      uint64_t PLL2RGE:2;
      uint64_t PLL3FRACEN:1;
      uint64_t PLL3VCOSEL:1;
      uint64_t PLL3RGE:2;
      uint64_t reservedSpace0:4;
      uint64_t DIVP1EN:1;
      uint64_t DIVQ1EN:1;
      uint64_t DIVR1EN:1;
      uint64_t DIVP2EN:1;
      uint64_t DIVQ2EN:1;
      uint64_t DIVR2EN:1;
      uint64_t DIVP3EN:1;
      uint64_t DIVQ3EN:1;
      uint64_t DIVR3EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLCFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVN1:9;
      uint64_t DIVP1:7;
      uint64_t DIVQ1:7;
      uint64_t reservedSpace0:1;
      uint64_t DIVR1:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL1DIVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t FRACN1:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL1FRACR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVN1:9;
      uint64_t DIVP1:7;
      uint64_t DIVQ1:7;
      uint64_t reservedSpace0:1;
      uint64_t DIVR1:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL2DIVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t FRACN2:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL2FRACR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVN3:9;
      uint64_t DIVP3:7;
      uint64_t DIVQ3:7;
      uint64_t reservedSpace0:1;
      uint64_t DIVR3:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL3DIVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t FRACN3:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL3FRACR;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FMCSRC:2;
      uint64_t reservedSpace0:2;
      uint64_t QSPISRC:2;
      uint64_t reservedSpace1:10;
      uint64_t SDMMCSRC:1;
      uint64_t reservedSpace2:11;
      uint64_t CKPERSRC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) D1CCIPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAI1SRC:3;
      uint64_t reservedSpace0:3;
      uint64_t SAI23SRC:3;
      uint64_t reservedSpace1:3;
      uint64_t SPI123SRC:3;
      uint64_t reservedSpace2:1;
      uint64_t SPI45SRC:3;
      uint64_t reservedSpace3:1;
      uint64_t SPDIFSRC:2;
      uint64_t reservedSpace4:2;
      uint64_t DFSDM1SRC:1;
      uint64_t reservedSpace5:3;
      uint64_t FDCANSRC:2;
      uint64_t reservedSpace6:1;
      uint64_t SWPSRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) D2CCIP1R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USART234578SRC:3;
      uint64_t USART16SRC:3;
      uint64_t reservedSpace0:2;
      uint64_t RNGSRC:2;
      uint64_t reservedSpace1:2;
      uint64_t I2C123SRC:2;
      uint64_t reservedSpace2:6;
      uint64_t USBSRC:2;
      uint64_t CECSRC:2;
      uint64_t reservedSpace3:4;
      uint64_t LPTIM1SRC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) D2CCIP2R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPUART1SRC:3;
      uint64_t reservedSpace0:5;
      uint64_t I2C4SRC:2;
      uint64_t LPTIM2SRC:3;
      uint64_t LPTIM345SRC:3;
      uint64_t ADCSRC:2;
      uint64_t reservedSpace1:3;
      uint64_t SAI4ASRC:3;
      uint64_t SAI4BSRC:3;
      uint64_t reservedSpace2:1;
      uint64_t SPI6SRC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) D3CCIPR;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSIRDYIE:1;
      uint64_t LSERDYIE:1;
      uint64_t HSIRDYIE:1;
      uint64_t HSERDYIE:1;
      uint64_t CSIRDYIE:1;
      uint64_t RC48RDYIE:1;
      uint64_t PLL1RDYIE:1;
      uint64_t PLL2RDYIE:1;
      uint64_t PLL3RDYIE:1;
      uint64_t LSECSSIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSIRDYF:1;
      uint64_t LSERDYF:1;
      uint64_t HSIRDYF:1;
      uint64_t HSERDYF:1;
      uint64_t CSIRDY:1;
      uint64_t RC48RDYF:1;
      uint64_t PLL1RDYF:1;
      uint64_t PLL2RDYF:1;
      uint64_t PLL3RDYF:1;
      uint64_t LSECSSF:1;
      uint64_t HSECSSF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSIRDYC:1;
      uint64_t LSERDYC:1;
      uint64_t HSIRDYC:1;
      uint64_t HSERDYC:1;
      uint64_t HSE_ready_Interrupt_Clear:1;
      uint64_t RC48RDYC:1;
      uint64_t PLL1RDYC:1;
      uint64_t PLL2RDYC:1;
      uint64_t PLL3RDYC:1;
      uint64_t LSECSSC:1;
      uint64_t HSECSSC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CICR;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSEON:1;
      uint64_t LSERDY:1;
      uint64_t LSEBYP:1;
      uint64_t LSEDRV:2;
      uint64_t LSECSSON:1;
      uint64_t LSECSSD:1;
      uint64_t reservedSpace0:1;
      uint64_t RTCSRC:2;
      uint64_t reservedSpace1:5;
      uint64_t RTCEN:1;
      uint64_t VSWRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BDCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSION:1;
      uint64_t LSIRDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDMARST:1;
      uint64_t reservedSpace0:3;
      uint64_t DMA2DRST:1;
      uint64_t JPGDECRST:1;
      uint64_t reservedSpace1:6;
      uint64_t FMCRST:1;
      uint64_t reservedSpace2:1;
      uint64_t QSPIRST:1;
      uint64_t reservedSpace3:1;
      uint64_t SDMMC1RST:1;
      uint64_t reservedSpace4:14;
      uint64_t CPURST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB3RSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1RST:1;
      uint64_t DMA2RST:1;
      uint64_t reservedSpace0:3;
      uint64_t ADC12RST:1;
      uint64_t reservedSpace1:9;
      uint64_t ETH1MACRST:1;
      uint64_t reservedSpace2:9;
      uint64_t USB1OTGRST:1;
      uint64_t reservedSpace3:1;
      uint64_t USB2OTGRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB1RSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAMITFRST:1;
      uint64_t reservedSpace0:3;
      uint64_t CRYPTRST:1;
      uint64_t HASHRST:1;
      uint64_t RNGRST:1;
      uint64_t reservedSpace1:2;
      uint64_t SDMMC2RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB2RSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIOARST:1;
      uint64_t GPIOBRST:1;
      uint64_t GPIOCRST:1;
      uint64_t GPIODRST:1;
      uint64_t GPIOERST:1;
      uint64_t GPIOFRST:1;
      uint64_t GPIOGRST:1;
      uint64_t GPIOHRST:1;
      uint64_t GPIOIRST:1;
      uint64_t GPIOJRST:1;
      uint64_t GPIOKRST:1;
      uint64_t reservedSpace0:8;
      uint64_t CRCRST:1;
      uint64_t reservedSpace1:1;
      uint64_t BDMARST:1;
      uint64_t reservedSpace2:2;
      uint64_t ADC3RST:1;
      uint64_t HSEMRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB4RSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t LTDCRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB3RSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2RST:1;
      uint64_t TIM3RST:1;
      uint64_t TIM4RST:1;
      uint64_t TIM5RST:1;
      uint64_t TIM6RST:1;
      uint64_t TIM7RST:1;
      uint64_t TIM12RST:1;
      uint64_t TIM13RST:1;
      uint64_t TIM14RST:1;
      uint64_t LPTIM1RST:1;
      uint64_t reservedSpace0:4;
      uint64_t SPI2RST:1;
      uint64_t SPI3RST:1;
      uint64_t SPDIFRXRST:1;
      uint64_t USART2RST:1;
      uint64_t USART3RST:1;
      uint64_t UART4RST:1;
      uint64_t UART5RST:1;
      uint64_t I2C1RST:1;
      uint64_t I2C2RST:1;
      uint64_t I2C3RST:1;
      uint64_t reservedSpace1:3;
      uint64_t HDMICECRST:1;
      uint64_t reservedSpace2:1;
      uint64_t DAC12RST:1;
      uint64_t USART7RST:1;
      uint64_t USART8RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1LRSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t CRSRST:1;
      uint64_t SWPRST:1;
      uint64_t reservedSpace1:1;
      uint64_t OPAMPRST:1;
      uint64_t MDIOSRST:1;
      uint64_t reservedSpace2:2;
      uint64_t FDCANRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1HRSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM1RST:1;
      uint64_t TIM8RST:1;
      uint64_t reservedSpace0:2;
      uint64_t USART1RST:1;
      uint64_t USART6RST:1;
      uint64_t reservedSpace1:6;
      uint64_t SPI1RST:1;
      uint64_t SPI4RST:1;
      uint64_t reservedSpace2:2;
      uint64_t TIM15RST:1;
      uint64_t TIM16RST:1;
      uint64_t TIM17RST:1;
      uint64_t reservedSpace3:1;
      uint64_t SPI5RST:1;
      uint64_t reservedSpace4:1;
      uint64_t SAI1RST:1;
      uint64_t SAI2RST:1;
      uint64_t SAI3RST:1;
      uint64_t reservedSpace5:3;
      uint64_t DFSDM1RST:1;
      uint64_t HRTIMRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2RSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SYSCFGRST:1;
      uint64_t reservedSpace1:1;
      uint64_t LPUART1RST:1;
      uint64_t reservedSpace2:1;
      uint64_t SPI6RST:1;
      uint64_t reservedSpace3:1;
      uint64_t I2C4RST:1;
      uint64_t reservedSpace4:1;
      uint64_t LPTIM2RST:1;
      uint64_t LPTIM3RST:1;
      uint64_t LPTIM4RST:1;
      uint64_t LPTIM5RST:1;
      uint64_t reservedSpace5:1;
      uint64_t COMP12RST:1;
      uint64_t VREFRST:1;
      uint64_t reservedSpace6:5;
      uint64_t SAI4RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB4RSTR;

