iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H7B3_FreeRTOS_QEMU/iSYSTEM_sfr.h
};

#define EXTI (*(volatile struct EXTI_tag *) 0x58000000)

struct DELAY_Block_SDMMC1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEN:1;
      uint64_t SEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:4;
      uint64_t reservedSpace0:4;
      uint64_t UNIT:7;
      uint64_t reservedSpace1:1;
      uint64_t LNG:12;
      uint64_t reservedSpace2:3;
      uint64_t LNGF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR;

};

#define DELAY_Block_SDMMC1 (*(volatile struct DELAY_Block_SDMMC1_tag *) 0x52008000)

struct DELAY_Block_SDMMC2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEN:1;
      uint64_t SEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:4;
      uint64_t reservedSpace0:4;
      uint64_t UNIT:7;
      uint64_t reservedSpace1:1;
      uint64_t LNG:12;
      uint64_t reservedSpace2:3;
      uint64_t LNGF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR;

};

#define DELAY_Block_SDMMC2 (*(volatile struct DELAY_Block_SDMMC2_tag *) 0x48022800)

struct Delay_Block_OCTOSPI1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEN:1;
      uint64_t SEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:4;
      uint64_t reservedSpace0:4;
      uint64_t UNIT:7;
      uint64_t reservedSpace1:1;
      uint64_t LNG:12;
      uint64_t reservedSpace2:3;
      uint64_t LNGF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR;

};

#define Delay_Block_OCTOSPI1 (*(volatile struct Delay_Block_OCTOSPI1_tag *) 0x52006000)

struct Delay_Block_OCTOSPI2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEN:1;
      uint64_t SEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:4;
      uint64_t reservedSpace0:4;
      uint64_t UNIT:7;
      uint64_t reservedSpace1:1;
      uint64_t LNG:12;
      uint64_t reservedSpace2:3;
      uint64_t LNGF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR;

};

#define Delay_Block_OCTOSPI2 (*(volatile struct Delay_Block_OCTOSPI2_tag *) 0x5200b000)

struct AXI_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t JEP106CON:4;
      uint64_t KCOUNT4:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_PERIPH_ID_4;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARTNUM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_PERIPH_ID_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARTNUM:4;
      uint64_t JEP106I:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_PERIPH_ID_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JEP106ID:3;
      uint64_t JEDEC:1;
      uint64_t REVISION:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_PERIPH_ID_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CUST_MOD_NUM:4;
      uint64_t REV_AND:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_PERIPH_ID_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PREAMBLE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_COMP_ID_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PREAMBLE:4;
      uint64_t CLASS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_COMP_ID_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PREAMBLE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_COMP_ID_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PREAMBLE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_COMP_ID_3;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t READ_ISS_OVERRIDE:1;
      uint64_t WRITE_ISS_OVERRIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_TARG1_FN_MOD_ISS_BM;

  uint8_t res2[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BYPASS_MERGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_TARG1_FN_MOD2;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FN_MOD_LB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_TARG1_FN_MOD_LB;

  uint8_t res4[216];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t READ_ISS_OVERRIDE:1;
      uint64_t WRITE_ISS_OVERRIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_TARG1_FN_MOD;

  uint8_t res5[3836];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t READ_ISS_OVERRIDE:1;
      uint64_t WRITE_ISS_OVERRIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_TARG2_FN_MOD_ISS_BM;

  uint8_t res6[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BYPASS_MERGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_TARG2_FN_MOD2;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FN_MOD_LB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_TARG2_FN_MOD_LB;

  uint8_t res8[216];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t READ_ISS_OVERRIDE:1;
      uint64_t WRITE_ISS_OVERRIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_TARG2_FN_MOD;

  uint8_t res9[3836];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t READ_ISS_OVERRIDE:1;
      uint64_t WRITE_ISS_OVERRIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_TARG3_FN_MOD_ISS_BM;

  uint8_t res10[4092];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t READ_ISS_OVERRIDE:1;
      uint64_t WRITE_ISS_OVERRIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_TARG4_FN_MOD_ISS_BM;

  uint8_t res11[4092];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t READ_ISS_OVERRIDE:1;
      uint64_t WRITE_ISS_OVERRIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_TARG5_FN_MOD_ISS_BM;

  uint8_t res12[4092];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t READ_ISS_OVERRIDE:1;
      uint64_t WRITE_ISS_OVERRIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_TARG6_FN_MOD_ISS_BM;

  uint8_t res13[4096];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t READ_ISS_OVERRIDE:1;
      uint64_t WRITE_ISS_OVERRIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_TARG7_FN_MOD_ISS_BM;

  uint8_t res14[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BYPASS_MERGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_TARG7_FN_MOD2;

  uint8_t res15[224];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t READ_ISS_OVERRIDE:1;
      uint64_t WRITE_ISS_OVERRIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_TARG7_FN_MOD;

  uint8_t res16[237336];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BYPASS_MERGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_INI1_FN_MOD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RD_INC_OVERRIDE:1;
      uint64_t WR_INC_OVERRIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_INI1_FN_MOD_AHB;

  uint8_t res17[212];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AR_QOS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_INI1_READ_QOS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AW_QOS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_INI1_WRITE_QOS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t READ_ISS_OVERRIDE:1;
      uint64_t WRITE_ISS_OVERRIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_INI1_FN_MOD;

  uint8_t res18[4084];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AR_QOS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_INI2_READ_QOS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AW_QOS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_INI2_WRITE_QOS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t READ_ISS_OVERRIDE:1;
      uint64_t WRITE_ISS_OVERRIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_INI2_FN_MOD;

  uint8_t res19[3864];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BYPASS_MERGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_INI3_FN_MOD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RD_INC_OVERRIDE:1;
      uint64_t WR_INC_OVERRIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_INI3_FN_MOD_AHB;

  uint8_t res20[212];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AR_QOS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_INI3_READ_QOS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AW_QOS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_INI3_WRITE_QOS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t READ_ISS_OVERRIDE:1;
      uint64_t WRITE_ISS_OVERRIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXI_INI3_FN_MOD;

