iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H7B3_FreeRTOS_QEMU/iSYSTEM_sfr.h
};

#define DMA2 (*(volatile struct DMA2_tag *) 0x40020400)

struct HRTIM_Master_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CK_PSC:3;
      uint64_t CONT:1;
      uint64_t RETRIG:1;
      uint64_t HALF:1;
      uint64_t reservedSpace0:2;
      uint64_t SYNC_IN:2;
      uint64_t SYNCRSTM:1;
      uint64_t SYNCSTRTM:1;
      uint64_t SYNC_OUT:2;
      uint64_t SYNC_SRC:2;
      uint64_t MCEN:1;
      uint64_t TACEN:1;
      uint64_t TBCEN:1;
      uint64_t TCCEN:1;
      uint64_t TDCEN:1;
      uint64_t TECEN:1;
      uint64_t reservedSpace1:3;
      uint64_t DACSYNC:2;
      uint64_t PREEN:1;
      uint64_t reservedSpace2:1;
      uint64_t MREPU:1;
      uint64_t BRSTDMA:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCMP1:1;
      uint64_t MCMP2:1;
      uint64_t MCMP3:1;
      uint64_t MCMP4:1;
      uint64_t MREP:1;
      uint64_t SYNC:1;
      uint64_t MUPD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCMP1C:1;
      uint64_t MCMP2C:1;
      uint64_t MCMP3C:1;
      uint64_t MCMP4C:1;
      uint64_t MREPC:1;
      uint64_t SYNCC:1;
      uint64_t MUPDC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCMP1IE:1;
      uint64_t MCMP2IE:1;
      uint64_t MCMP3IE:1;
      uint64_t MCMP4IE:1;
      uint64_t MREPIE:1;
      uint64_t SYNCIE:1;
      uint64_t MUPDIE:1;
      uint64_t reservedSpace0:9;
      uint64_t MCMP1DE:1;
      uint64_t MCMP2DE:1;
      uint64_t MCMP3DE:1;
      uint64_t MCMP4DE:1;
      uint64_t MREPDE:1;
      uint64_t SYNCDE:1;
      uint64_t MUPDDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIER4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCNTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MREP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MREP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCMP1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCMP1R;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCMP2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCMP2R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCMP3:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCMP3R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCMP4:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCMP4R;

};

#define HRTIM_Master (*(volatile struct HRTIM_Master_tag *) 0x40017400)

struct HRTIM_TIMA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CK_PSCx:3;
      uint64_t CONT:1;
      uint64_t RETRIG:1;
      uint64_t HALF:1;
      uint64_t PSHPLL:1;
      uint64_t reservedSpace0:3;
      uint64_t SYNCRSTx:1;
      uint64_t SYNCSTRTx:1;
      uint64_t DELCMP2:2;
      uint64_t DELCMP4:2;
      uint64_t reservedSpace1:1;
      uint64_t TxREPU:1;
      uint64_t TxRSTU:1;
      uint64_t reservedSpace2:1;
      uint64_t TBU:1;
      uint64_t TCU:1;
      uint64_t TDU:1;
      uint64_t TEU:1;
      uint64_t MSTU:1;
      uint64_t DACSYNC:2;
      uint64_t PREEN:1;
      uint64_t UPDGAT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMACR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP1:1;
      uint64_t CMP2:1;
      uint64_t CMP3:1;
      uint64_t CMP4:1;
      uint64_t REP:1;
      uint64_t reservedSpace0:1;
      uint64_t UPD:1;
      uint64_t CPT1:1;
      uint64_t CPT2:1;
      uint64_t SETx1:1;
      uint64_t RSTx1:1;
      uint64_t SETx2:1;
      uint64_t RSTx2:1;
      uint64_t RST:1;
      uint64_t DLYPRT:1;
      uint64_t reservedSpace1:1;
      uint64_t CPPSTAT:1;
      uint64_t IPPSTAT:1;
      uint64_t O1STAT:1;
      uint64_t O2STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMAISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP1C:1;
      uint64_t CMP2C:1;
      uint64_t CMP3C:1;
      uint64_t CMP4C:1;
      uint64_t REPC:1;
      uint64_t reservedSpace0:1;
      uint64_t UPDC:1;
      uint64_t CPT1C:1;
      uint64_t CPT2C:1;
      uint64_t SET1xC:1;
      uint64_t RSTx1C:1;
      uint64_t SET2xC:1;
      uint64_t RSTx2C:1;
      uint64_t RSTC:1;
      uint64_t DLYPRTC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMAICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP1IE:1;
      uint64_t CMP2IE:1;
      uint64_t CMP3IE:1;
      uint64_t CMP4IE:1;
      uint64_t REPIE:1;
      uint64_t reservedSpace0:1;
      uint64_t UPDIE:1;
      uint64_t CPT1IE:1;
      uint64_t CPT2IE:1;
      uint64_t SET1xIE:1;
      uint64_t RSTx1IE:1;
      uint64_t SETx2IE:1;
      uint64_t RSTx2IE:1;
      uint64_t RSTIE:1;
      uint64_t DLYPRTIE:1;
      uint64_t reservedSpace1:1;
      uint64_t CMP1DE:1;
      uint64_t CMP2DE:1;
      uint64_t CMP3DE:1;
      uint64_t CMP4DE:1;
      uint64_t REPDE:1;
      uint64_t reservedSpace2:1;
      uint64_t UPDDE:1;
      uint64_t CPT1DE:1;
      uint64_t CPT2DE:1;
      uint64_t SET1xDE:1;
      uint64_t RSTx1DE:1;
      uint64_t SETx2DE:1;
      uint64_t RSTx2DE:1;
      uint64_t RSTDE:1;
      uint64_t DLYPRTDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMADIER5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNTx:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNTAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERx:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REPx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REPAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP1x:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP1AR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP1x:16;
      uint64_t REPx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP1CAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP2x:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP2AR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP3x:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP3AR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP4x:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP4AR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPT1x:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPT1AR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPT2x:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPT2AR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTRx:9;
      uint64_t SDTRx:1;
      uint64_t DTPRSC:3;
      uint64_t reservedSpace0:1;
      uint64_t DTRSLKx:1;
      uint64_t DTRLKx:1;
      uint64_t DTFx:9;
      uint64_t SDTFx:1;
      uint64_t reservedSpace1:4;
      uint64_t DTFSLKx:1;
      uint64_t DTFLKx:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DTAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SST:1;
      uint64_t RESYNC:1;
      uint64_t PER:1;
      uint64_t CMP1:1;
      uint64_t CMP2:1;
      uint64_t CMP3:1;
      uint64_t CMP4:1;
      uint64_t MSTPER:1;
      uint64_t MSTCMP1:1;
      uint64_t MSTCMP2:1;
      uint64_t MSTCMP3:1;
      uint64_t MSTCMP4:1;
      uint64_t TIMEVNT1:1;
      uint64_t TIMEVNT2:1;
      uint64_t TIMEVNT3:1;
      uint64_t TIMEVNT4:1;
      uint64_t TIMEVNT5:1;
      uint64_t TIMEVNT6:1;
      uint64_t TIMEVNT7:1;
      uint64_t TIMEVNT8:1;
      uint64_t TIMEVNT9:1;
      uint64_t EXTEVNT1:1;
      uint64_t EXTEVNT2:1;
      uint64_t EXTEVNT3:1;
      uint64_t EXTEVNT4:1;
      uint64_t EXTEVNT5:1;
      uint64_t EXTEVNT6:1;
      uint64_t EXTEVNT7:1;
      uint64_t EXTEVNT8:1;
      uint64_t EXTEVNT9:1;
      uint64_t EXTEVNT10:1;
      uint64_t UPDATE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SETA1R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRT:1;
      uint64_t RESYNC:1;
      uint64_t PER:1;
      uint64_t CMP1:1;
      uint64_t CMP2:1;
      uint64_t CMP3:1;
      uint64_t CMP4:1;
      uint64_t MSTPER:1;
      uint64_t MSTCMP1:1;
      uint64_t MSTCMP2:1;
      uint64_t MSTCMP3:1;
      uint64_t MSTCMP4:1;
      uint64_t TIMEVNT1:1;
      uint64_t TIMEVNT2:1;
      uint64_t TIMEVNT3:1;
      uint64_t TIMEVNT4:1;
      uint64_t TIMEVNT5:1;
      uint64_t TIMEVNT6:1;
      uint64_t TIMEVNT7:1;
      uint64_t TIMEVNT8:1;
      uint64_t TIMEVNT9:1;
      uint64_t EXTEVNT1:1;
      uint64_t EXTEVNT2:1;
      uint64_t EXTEVNT3:1;
      uint64_t EXTEVNT4:1;
      uint64_t EXTEVNT5:1;
      uint64_t EXTEVNT6:1;
      uint64_t EXTEVNT7:1;
      uint64_t EXTEVNT8:1;
      uint64_t EXTEVNT9:1;
      uint64_t EXTEVNT10:1;
      uint64_t UPDATE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSTA1R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SST:1;
      uint64_t RESYNC:1;
      uint64_t PER:1;
      uint64_t CMP1:1;
      uint64_t CMP2:1;
      uint64_t CMP3:1;
      uint64_t CMP4:1;
      uint64_t MSTPER:1;
      uint64_t MSTCMP1:1;
      uint64_t MSTCMP2:1;
      uint64_t MSTCMP3:1;
      uint64_t MSTCMP4:1;
      uint64_t TIMEVNT1:1;
      uint64_t TIMEVNT2:1;
      uint64_t TIMEVNT3:1;
      uint64_t TIMEVNT4:1;
      uint64_t TIMEVNT5:1;
      uint64_t TIMEVNT6:1;
      uint64_t TIMEVNT7:1;
      uint64_t TIMEVNT8:1;
      uint64_t TIMEVNT9:1;
      uint64_t EXTEVNT1:1;
      uint64_t EXTEVNT2:1;
      uint64_t EXTEVNT3:1;
      uint64_t EXTEVNT4:1;
      uint64_t EXTEVNT5:1;
      uint64_t EXTEVNT6:1;
      uint64_t EXTEVNT7:1;
      uint64_t EXTEVNT8:1;
      uint64_t EXTEVNT9:1;
      uint64_t EXTEVNT10:1;
      uint64_t UPDATE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SETA2R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRT:1;
      uint64_t RESYNC:1;
      uint64_t PER:1;
      uint64_t CMP1:1;
      uint64_t CMP2:1;
      uint64_t CMP3:1;
      uint64_t CMP4:1;
      uint64_t MSTPER:1;
      uint64_t MSTCMP1:1;
      uint64_t MSTCMP2:1;
      uint64_t MSTCMP3:1;
      uint64_t MSTCMP4:1;
      uint64_t TIMEVNT1:1;
      uint64_t TIMEVNT2:1;
      uint64_t TIMEVNT3:1;
      uint64_t TIMEVNT4:1;
      uint64_t TIMEVNT5:1;
      uint64_t TIMEVNT6:1;
      uint64_t TIMEVNT7:1;
      uint64_t TIMEVNT8:1;
      uint64_t TIMEVNT9:1;
      uint64_t EXTEVNT1:1;
      uint64_t EXTEVNT2:1;
      uint64_t EXTEVNT3:1;
      uint64_t EXTEVNT4:1;
      uint64_t EXTEVNT5:1;
      uint64_t EXTEVNT6:1;
      uint64_t EXTEVNT7:1;
      uint64_t EXTEVNT8:1;
      uint64_t EXTEVNT9:1;
      uint64_t EXTEVNT10:1;
      uint64_t UPDATE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSTA2R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EE1LTCH:1;
      uint64_t EE1FLTR:4;
      uint64_t reservedSpace0:1;
      uint64_t EE2LTCH:1;
      uint64_t EE2FLTR:4;
      uint64_t reservedSpace1:1;
      uint64_t EE3LTCH:1;
      uint64_t EE3FLTR:4;
      uint64_t reservedSpace2:1;
      uint64_t EE4LTCH:1;
      uint64_t EE4FLTR:4;
      uint64_t reservedSpace3:1;
      uint64_t EE5LTCH:1;
      uint64_t EE5FLTR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EEFAR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EE6LTCH:1;
      uint64_t EE6FLTR:4;
      uint64_t reservedSpace0:1;
      uint64_t EE7LTCH:1;
      uint64_t EE7FLTR:4;
      uint64_t reservedSpace1:1;
      uint64_t EE8LTCH:1;
      uint64_t EE8FLTR:4;
      uint64_t reservedSpace2:1;
      uint64_t EE9LTCH:1;
      uint64_t EE9FLTR:4;
      uint64_t reservedSpace3:1;
      uint64_t EE10LTCH:1;
      uint64_t EE10FLTR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EEFAR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t UPDT:1;
      uint64_t CMP2:1;
      uint64_t CMP4:1;
      uint64_t MSTPER:1;
      uint64_t MSTCMP1:1;
      uint64_t MSTCMP2:1;
      uint64_t MSTCMP3:1;
      uint64_t MSTCMP4:1;
      uint64_t EXTEVNT1:1;
      uint64_t EXTEVNT2:1;
      uint64_t EXTEVNT3:1;
      uint64_t EXTEVNT4:1;
      uint64_t EXTEVNT5:1;
      uint64_t EXTEVNT6:1;
      uint64_t EXTEVNT7:1;
      uint64_t EXTEVNT8:1;
      uint64_t EXTEVNT9:1;
      uint64_t EXTEVNT10:1;
      uint64_t TIMBCMP1:1;
      uint64_t TIMBCMP2:1;
      uint64_t TIMBCMP4:1;
      uint64_t TIMCCMP1:1;
      uint64_t TIMCCMP2:1;
      uint64_t TIMCCMP4:1;
      uint64_t TIMDCMP1:1;
      uint64_t TIMDCMP2:1;
      uint64_t TIMDCMP4:1;
      uint64_t TIMECMP1:1;
      uint64_t TIMECMP2:1;
      uint64_t TIMECMP4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSTAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHPFRQ:4;
      uint64_t CHPDTY:3;
      uint64_t STRTPW:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHPAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWCPT:1;
      uint64_t UDPCPT:1;
      uint64_t EXEV1CPT:1;
      uint64_t EXEV2CPT:1;
      uint64_t EXEV3CPT:1;
      uint64_t EXEV4CPT:1;
      uint64_t EXEV5CPT:1;
      uint64_t EXEV6CPT:1;
      uint64_t EXEV7CPT:1;
      uint64_t EXEV8CPT:1;
      uint64_t EXEV9CPT:1;
      uint64_t EXEV10CPT:1;
      uint64_t reservedSpace0:4;
      uint64_t TB1SET:1;
      uint64_t TB1RST:1;
      uint64_t TBCMP1:1;
      uint64_t TBCMP2:1;
      uint64_t TC1SET:1;
      uint64_t TC1RST:1;
      uint64_t TCCMP1:1;
      uint64_t TCCMP2:1;
      uint64_t TD1SET:1;
      uint64_t TD1RST:1;
      uint64_t TDCMP1:1;
      uint64_t TDCMP2:1;
      uint64_t TE1SET:1;
      uint64_t TE1RST:1;
      uint64_t TECMP1:1;
      uint64_t TECMP2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPT1ACR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWCPT:1;
      uint64_t UDPCPT:1;
      uint64_t EXEV1CPT:1;
      uint64_t EXEV2CPT:1;
      uint64_t EXEV3CPT:1;
      uint64_t EXEV4CPT:1;
      uint64_t EXEV5CPT:1;
      uint64_t EXEV6CPT:1;
      uint64_t EXEV7CPT:1;
      uint64_t EXEV8CPT:1;
      uint64_t EXEV9CPT:1;
      uint64_t EXEV10CPT:1;
      uint64_t reservedSpace0:4;
      uint64_t TB1SET:1;
      uint64_t TB1RST:1;
      uint64_t TBCMP1:1;
      uint64_t TBCMP2:1;
      uint64_t TC1SET:1;
      uint64_t TC1RST:1;
      uint64_t TCCMP1:1;
      uint64_t TCCMP2:1;
      uint64_t TD1SET:1;
      uint64_t TD1RST:1;
      uint64_t TDCMP1:1;
      uint64_t TDCMP2:1;
      uint64_t TE1SET:1;
      uint64_t TE1RST:1;
      uint64_t TECMP1:1;
      uint64_t TECMP2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPT2ACR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t POL1:1;
      uint64_t IDLEM1:1;
      uint64_t IDLES1:1;
      uint64_t FAULT1:2;
      uint64_t CHP1:1;
      uint64_t DIDL1:1;
      uint64_t DTEN:1;
      uint64_t DLYPRTEN:1;
      uint64_t DLYPRT:3;
      uint64_t reservedSpace1:4;
      uint64_t POL2:1;
      uint64_t IDLEM2:1;
      uint64_t IDLES2:1;
      uint64_t FAULT2:2;
      uint64_t CHP2:1;
      uint64_t DIDL2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OUTAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLT1EN:1;
      uint64_t FLT2EN:1;
      uint64_t FLT3EN:1;
      uint64_t FLT4EN:1;
      uint64_t FLT5EN:1;
      uint64_t reservedSpace0:26;
      uint64_t FLTLCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLTAR;

