iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H7B3_FreeRTOS_QEMU/iSYSTEM_sfr.h
};

#define HRTIM_TIME (*(volatile struct HRTIM_TIME_tag *) 0x40017680)

struct HRTIM_Common_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MUDIS:1;
      uint64_t TAUDIS:1;
      uint64_t TBUDIS:1;
      uint64_t TCUDIS:1;
      uint64_t TDUDIS:1;
      uint64_t TEUDIS:1;
      uint64_t reservedSpace0:10;
      uint64_t AD1USRC:3;
      uint64_t AD2USRC:3;
      uint64_t AD3USRC:3;
      uint64_t AD4USRC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSWU:1;
      uint64_t TASWU:1;
      uint64_t TBSWU:1;
      uint64_t TCSWU:1;
      uint64_t TDSWU:1;
      uint64_t TESWU:1;
      uint64_t reservedSpace0:2;
      uint64_t MRST:1;
      uint64_t TARST:1;
      uint64_t TBRST:1;
      uint64_t TCRST:1;
      uint64_t TDRST:1;
      uint64_t TERST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLT1:1;
      uint64_t FLT2:1;
      uint64_t FLT3:1;
      uint64_t FLT4:1;
      uint64_t FLT5:1;
      uint64_t SYSFLT:1;
      uint64_t reservedSpace0:10;
      uint64_t DLLRDY:1;
      uint64_t BMPER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLT1C:1;
      uint64_t FLT2C:1;
      uint64_t FLT3C:1;
      uint64_t FLT4C:1;
      uint64_t FLT5C:1;
      uint64_t SYSFLTC:1;
      uint64_t reservedSpace0:10;
      uint64_t DLLRDYC:1;
      uint64_t BMPERC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLT1IE:1;
      uint64_t FLT2IE:1;
      uint64_t FLT3IE:1;
      uint64_t FLT4IE:1;
      uint64_t FLT5IE:1;
      uint64_t SYSFLTE:1;
      uint64_t reservedSpace0:10;
      uint64_t DLLRDYIE:1;
      uint64_t BMPERIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TA1OEN:1;
      uint64_t TA2OEN:1;
      uint64_t TB1OEN:1;
      uint64_t TB2OEN:1;
      uint64_t TC1OEN:1;
      uint64_t TC2OEN:1;
      uint64_t TD1OEN:1;
      uint64_t TD2OEN:1;
      uint64_t TE1OEN:1;
      uint64_t TE2OEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TA1ODIS:1;
      uint64_t TA2ODIS:1;
      uint64_t TB1ODIS:1;
      uint64_t TB2ODIS:1;
      uint64_t TC1ODIS:1;
      uint64_t TC2ODIS:1;
      uint64_t TD1ODIS:1;
      uint64_t TD2ODIS:1;
      uint64_t TE1ODIS:1;
      uint64_t TE2ODIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TA1ODS:1;
      uint64_t TA2ODS:1;
      uint64_t TB1ODS:1;
      uint64_t TB2ODS:1;
      uint64_t TC1ODS:1;
      uint64_t TC2ODS:1;
      uint64_t TD1ODS:1;
      uint64_t TD2ODS:1;
      uint64_t TE1ODS:1;
      uint64_t TE2ODS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ODSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BME:1;
      uint64_t BMOM:1;
      uint64_t BMCLK:4;
      uint64_t BMPRSC:4;
      uint64_t BMPREN:1;
      uint64_t reservedSpace0:5;
      uint64_t MTBM:1;
      uint64_t TABM:1;
      uint64_t TBBM:1;
      uint64_t TCBM:1;
      uint64_t TDBM:1;
      uint64_t TEBM:1;
      uint64_t reservedSpace1:9;
      uint64_t BMSTAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BMCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SW:1;
      uint64_t MSTRST:1;
      uint64_t MSTREP:1;
      uint64_t MSTCMP1:1;
      uint64_t MSTCMP2:1;
      uint64_t MSTCMP3:1;
      uint64_t MSTCMP4:1;
      uint64_t TARST:1;
      uint64_t TAREP:1;
      uint64_t TACMP1:1;
      uint64_t TACMP2:1;
      uint64_t TBRST:1;
      uint64_t TBREP:1;
      uint64_t TBCMP1:1;
      uint64_t TBCMP2:1;
      uint64_t TCRST:1;
      uint64_t TCREP:1;
      uint64_t TCCMP1:1;
      uint64_t TCCMP2:1;
      uint64_t TDRST:1;
      uint64_t TDREP:1;
      uint64_t TDCMP1:1;
      uint64_t TDCMP2:1;
      uint64_t TERST:1;
      uint64_t TEREP:1;
      uint64_t TECMP1:1;
      uint64_t TECMP2:1;
      uint64_t reservedSpace0:4;
      uint64_t OCHPEV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BMTRG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BMCMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BMCMPR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BMPER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BMPER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EE1SRC:2;
      uint64_t EE1POL:1;
      uint64_t EE1SNS:2;
      uint64_t EE1FAST:1;
      uint64_t EE2SRC:2;
      uint64_t EE2POL:1;
      uint64_t EE2SNS:2;
      uint64_t EE2FAST:1;
      uint64_t EE3SRC:2;
      uint64_t EE3POL:1;
      uint64_t EE3SNS:2;
      uint64_t EE3FAST:1;
      uint64_t EE4SRC:2;
      uint64_t EE4POL:1;
      uint64_t EE4SNS:2;
      uint64_t EE4FAST:1;
      uint64_t EE5SRC:2;
      uint64_t EE5POL:1;
      uint64_t EE5SNS:2;
      uint64_t EE5FAST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EECR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EE6SRC:2;
      uint64_t EE6POL:1;
      uint64_t EE6SNS:2;
      uint64_t reservedSpace0:1;
      uint64_t EE7SRC:2;
      uint64_t EE7POL:1;
      uint64_t EE7SNS:2;
      uint64_t reservedSpace1:1;
      uint64_t EE8SRC:2;
      uint64_t EE8POL:1;
      uint64_t EE8SNS:2;
      uint64_t reservedSpace2:1;
      uint64_t EE9SRC:2;
      uint64_t EE9POL:1;
      uint64_t EE9SNS:2;
      uint64_t reservedSpace3:1;
      uint64_t EE10SRC:2;
      uint64_t EE10POL:1;
      uint64_t EE10SNS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EECR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EE6SRC:2;
      uint64_t EE6POL:1;
      uint64_t EE6SNS:2;
      uint64_t reservedSpace0:1;
      uint64_t EE7SRC:2;
      uint64_t EE7POL:1;
      uint64_t EE7SNS:2;
      uint64_t reservedSpace1:1;
      uint64_t EE8SRC:2;
      uint64_t EE8POL:1;
      uint64_t EE8SNS:2;
      uint64_t reservedSpace2:1;
      uint64_t EE9SRC:2;
      uint64_t EE9POL:1;
      uint64_t EE9SNS:2;
      uint64_t reservedSpace3:1;
      uint64_t EE10SRC:2;
      uint64_t EE10POL:1;
      uint64_t EE10SNS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EECR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AD1MC1:1;
      uint64_t AD1MC2:1;
      uint64_t AD1MC3:1;
      uint64_t AD1MC4:1;
      uint64_t AD1MPER:1;
      uint64_t AD1EEV1:1;
      uint64_t AD1EEV2:1;
      uint64_t AD1EEV3:1;
      uint64_t AD1EEV4:1;
      uint64_t AD1EEV5:1;
      uint64_t AD1TAC2:1;
      uint64_t AD1TAC3:1;
      uint64_t AD1TAC4:1;
      uint64_t AD1TAPER:1;
      uint64_t AD1TARST:1;
      uint64_t AD1TBC2:1;
      uint64_t AD1TBC3:1;
      uint64_t AD1TBC4:1;
      uint64_t AD1TBPER:1;
      uint64_t AD1TBRST:1;
      uint64_t AD1TCC2:1;
      uint64_t AD1TCC3:1;
      uint64_t AD1TCC4:1;
      uint64_t AD1TCPER:1;
      uint64_t AD1TDC2:1;
      uint64_t AD1TDC3:1;
      uint64_t AD1TDC4:1;
      uint64_t AD1TDPER:1;
      uint64_t AD1TEC2:1;
      uint64_t AD1TEC3:1;
      uint64_t AD1TEC4:1;
      uint64_t AD1TEPER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AD2MC1:1;
      uint64_t AD2MC2:1;
      uint64_t AD2MC3:1;
      uint64_t AD2MC4:1;
      uint64_t AD2MPER:1;
      uint64_t AD2EEV6:1;
      uint64_t AD2EEV7:1;
      uint64_t AD2EEV8:1;
      uint64_t AD2EEV9:1;
      uint64_t AD2EEV10:1;
      uint64_t AD2TAC2:1;
      uint64_t AD2TAC3:1;
      uint64_t AD2TAC4:1;
      uint64_t AD2TAPER:1;
      uint64_t AD2TBC2:1;
      uint64_t AD2TBC3:1;
      uint64_t AD2TBC4:1;
      uint64_t AD2TBPER:1;
      uint64_t AD2TCC2:1;
      uint64_t AD2TCC3:1;
      uint64_t AD2TCC4:1;
      uint64_t AD2TCPER:1;
      uint64_t AD2TCRST:1;
      uint64_t AD2TDC2:1;
      uint64_t AD2TDC3:1;
      uint64_t AD2TDC4:1;
      uint64_t AD2TDPER:1;
      uint64_t AD2TDRST:1;
      uint64_t AD2TEC2:1;
      uint64_t AD2TEC3:1;
      uint64_t AD2TEC4:1;
      uint64_t AD2TERST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC2R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AD1MC1:1;
      uint64_t AD1MC2:1;
      uint64_t AD1MC3:1;
      uint64_t AD1MC4:1;
      uint64_t AD1MPER:1;
      uint64_t AD1EEV1:1;
      uint64_t AD1EEV2:1;
      uint64_t AD1EEV3:1;
      uint64_t AD1EEV4:1;
      uint64_t AD1EEV5:1;
      uint64_t AD1TAC2:1;
      uint64_t AD1TAC3:1;
      uint64_t AD1TAC4:1;
      uint64_t AD1TAPER:1;
      uint64_t AD1TARST:1;
      uint64_t AD1TBC2:1;
      uint64_t AD1TBC3:1;
      uint64_t AD1TBC4:1;
      uint64_t AD1TBPER:1;
      uint64_t AD1TBRST:1;
      uint64_t AD1TCC2:1;
      uint64_t AD1TCC3:1;
      uint64_t AD1TCC4:1;
      uint64_t AD1TCPER:1;
      uint64_t AD1TDC2:1;
      uint64_t AD1TDC3:1;
      uint64_t AD1TDC4:1;
      uint64_t AD1TDPER:1;
      uint64_t AD1TEC2:1;
      uint64_t AD1TEC3:1;
      uint64_t AD1TEC4:1;
      uint64_t AD1TEPER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC3R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AD2MC1:1;
      uint64_t AD2MC2:1;
      uint64_t AD2MC3:1;
      uint64_t AD2MC4:1;
      uint64_t AD2MPER:1;
      uint64_t AD2EEV6:1;
      uint64_t AD2EEV7:1;
      uint64_t AD2EEV8:1;
      uint64_t AD2EEV9:1;
      uint64_t AD2EEV10:1;
      uint64_t AD2TAC2:1;
      uint64_t AD2TAC3:1;
      uint64_t AD2TAC4:1;
      uint64_t AD2TAPER:1;
      uint64_t AD2TBC2:1;
      uint64_t AD2TBC3:1;
      uint64_t AD2TBC4:1;
      uint64_t AD2TBPER:1;
      uint64_t AD2TCC2:1;
      uint64_t AD2TCC3:1;
      uint64_t AD2TCC4:1;
      uint64_t AD2TCPER:1;
      uint64_t AD2TCRST:1;
      uint64_t AD2TDC2:1;
      uint64_t AD2TDC3:1;
      uint64_t AD2TDC4:1;
      uint64_t AD2TDPER:1;
      uint64_t AD2TDRST:1;
      uint64_t AD2TEC2:1;
      uint64_t AD2TEC3:1;
      uint64_t AD2TEC4:1;
      uint64_t AD2TERST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC4R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAL:1;
      uint64_t CALEN:1;
      uint64_t CALRTE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLLCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLT1E:1;
      uint64_t FLT1P:1;
      uint64_t FLT1SRC:1;
      uint64_t FLT1F:4;
      uint64_t FLT1LCK:1;
      uint64_t FLT2E:1;
      uint64_t FLT2P:1;
      uint64_t FLT2SRC:1;
      uint64_t FLT2F:4;
      uint64_t FLT2LCK:1;
      uint64_t FLT3E:1;
      uint64_t FLT3P:1;
      uint64_t FLT3SRC:1;
      uint64_t FLT3F:4;
      uint64_t FLT3LCK:1;
      uint64_t FLT4E:1;
      uint64_t FLT4P:1;
      uint64_t FLT4SRC:1;
      uint64_t FLT4F:4;
      uint64_t FLT4LCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLTINR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLT5E:1;
      uint64_t FLT5P:1;
      uint64_t FLT5SRC:1;
      uint64_t FLT5F:4;
      uint64_t FLT5LCK:1;
      uint64_t reservedSpace0:16;
      uint64_t FLTSD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLTINR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCR:1;
      uint64_t MICR:1;
      uint64_t MDIER:1;
      uint64_t MCNT:1;
      uint64_t MPER:1;
      uint64_t MREP:1;
      uint64_t MCMP1:1;
      uint64_t MCMP2:1;
      uint64_t MCMP3:1;
      uint64_t MCMP4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BDMUPDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMxCR:1;
      uint64_t TIMxICR:1;
      uint64_t TIMxDIER:1;
      uint64_t TIMxCNT:1;
      uint64_t TIMxPER:1;
      uint64_t TIMxREP:1;
      uint64_t TIMxCMP1:1;
      uint64_t TIMxCMP2:1;
      uint64_t TIMxCMP3:1;
      uint64_t TIMxCMP4:1;
      uint64_t TIMx_DTxR:1;
      uint64_t TIMxSET1R:1;
      uint64_t TIMxRST1R:1;
      uint64_t TIMxSET2R:1;
      uint64_t TIMxRST2R:1;
      uint64_t TIMxEEFR1:1;
      uint64_t TIMxEEFR2:1;
      uint64_t TIMxRSTR:1;
      uint64_t TIMxCHPR:1;
      uint64_t TIMxOUTR:1;
      uint64_t TIMxFLTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BDTxUPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BDMADR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BDMADR;

