iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H7B3_FreeRTOS_QEMU/iSYSTEM_sfr.h
  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIDM:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_XIDAM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BIDX:6;
      uint64_t MSI:2;
      uint64_t FIDX:7;
      uint64_t FLST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_HPMS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ND0:1;
      uint64_t ND1:1;
      uint64_t ND2:1;
      uint64_t ND3:1;
      uint64_t ND4:1;
      uint64_t ND5:1;
      uint64_t ND6:1;
      uint64_t ND7:1;
      uint64_t ND8:1;
      uint64_t ND9:1;
      uint64_t ND10:1;
      uint64_t ND11:1;
      uint64_t ND12:1;
      uint64_t ND13:1;
      uint64_t ND14:1;
      uint64_t ND15:1;
      uint64_t ND16:1;
      uint64_t ND17:1;
      uint64_t ND18:1;
      uint64_t ND19:1;
      uint64_t ND20:1;
      uint64_t ND21:1;
      uint64_t ND22:1;
      uint64_t ND23:1;
      uint64_t ND24:1;
      uint64_t ND25:1;
      uint64_t ND26:1;
      uint64_t ND27:1;
      uint64_t ND28:1;
      uint64_t ND29:1;
      uint64_t ND30:1;
      uint64_t ND31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_NDAT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ND32:1;
      uint64_t ND33:1;
      uint64_t ND34:1;
      uint64_t ND35:1;
      uint64_t ND36:1;
      uint64_t ND37:1;
      uint64_t ND38:1;
      uint64_t ND39:1;
      uint64_t ND40:1;
      uint64_t ND41:1;
      uint64_t ND42:1;
      uint64_t ND43:1;
      uint64_t ND44:1;
      uint64_t ND45:1;
      uint64_t ND46:1;
      uint64_t ND47:1;
      uint64_t ND48:1;
      uint64_t ND49:1;
      uint64_t ND50:1;
      uint64_t ND51:1;
      uint64_t ND52:1;
      uint64_t ND53:1;
      uint64_t ND54:1;
      uint64_t ND55:1;
      uint64_t ND56:1;
      uint64_t ND57:1;
      uint64_t ND58:1;
      uint64_t ND59:1;
      uint64_t ND60:1;
      uint64_t ND61:1;
      uint64_t ND62:1;
      uint64_t ND63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_NDAT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t F0SA:14;
      uint64_t F0S:8;
      uint64_t F0WM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_RXF0C;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F0FL:7;
      uint64_t reservedSpace0:1;
      uint64_t F0G:6;
      uint64_t reservedSpace1:2;
      uint64_t F0P:6;
      uint64_t reservedSpace2:2;
      uint64_t F0F:1;
      uint64_t RF0L:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_RXF0S;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FA01:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_RXF0A;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RBSA:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_RXBC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t F1SA:14;
      uint64_t F1S:7;
      uint64_t reservedSpace1:1;
      uint64_t F1WM:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_RXF1C;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F1FL:7;
      uint64_t reservedSpace0:1;
      uint64_t F1GI:7;
      uint64_t reservedSpace1:1;
      uint64_t F1PI:7;
      uint64_t reservedSpace2:1;
      uint64_t F1F:1;
      uint64_t RF1L:1;
      uint64_t reservedSpace3:4;
      uint64_t DMS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_RXF1S;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F1AI:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_RXF1A;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F0DS:3;
      uint64_t reservedSpace0:1;
      uint64_t F1DS:3;
      uint64_t reservedSpace1:1;
      uint64_t RBDS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_RXESC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t TBSA:14;
      uint64_t NDTB:6;
      uint64_t reservedSpace1:2;
      uint64_t TFQS:6;
      uint64_t TFQM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TXBC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFFL:6;
      uint64_t reservedSpace0:2;
      uint64_t TFGI:5;
      uint64_t reservedSpace1:3;
      uint64_t TFQPI:5;
      uint64_t TFQF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TXFQS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TBDS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TXESC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TXBRP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TXBAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TXBCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TXBTO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TXBCF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TXBTIE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TXBCIE;

  uint8_t res5[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t EFSA:14;
      uint64_t EFS:6;
      uint64_t reservedSpace1:2;
      uint64_t EFWM:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TXEFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFFL:6;
      uint64_t reservedSpace0:2;
      uint64_t EFGI:5;
      uint64_t reservedSpace1:11;
      uint64_t EFF:1;
      uint64_t TEFL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TXEFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFAI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCAN_TXEFA;

