iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H7B3_FreeRTOS_QEMU/iSYSTEM_sfr.h
};

#define CAN_CCU (*(volatile struct CAN_CCU_tag *) 0x4000a800)

struct MDIOS_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t WRIE:1;
      uint64_t RDIE:1;
      uint64_t EIE:1;
      uint64_t reservedSpace0:3;
      uint64_t DPC:1;
      uint64_t PORT_ADDRESS:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_WRFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CWRF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_CWRFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_RDFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_CRDFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERF:1;
      uint64_t SERF:1;
      uint64_t TERF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPERF:1;
      uint64_t CSERF:1;
      uint64_t CTERF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_CLRFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN3:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN4:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN5:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN6:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN7:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN8:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN9:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN10:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN11:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN12:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN13:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN14:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN15:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN17:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN18:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN19:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN20:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN21:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN22:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN23:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN24:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN25:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN26:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN27:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN28:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN29:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN30:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN31:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DINR31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT3:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT4:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT5:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT6:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT7:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT8:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT9:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT10:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT11:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT12:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT13:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT14:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT15:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT17:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT18:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT19:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT20:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT21:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT22:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT23:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT24:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT25:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT26:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT27:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT28:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT29:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT30:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOUT31:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDIOS_DOUTR31;

