iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32H7B3_FreeRTOS_QEMU/iSYSTEM_sfr.h
  uint8_t res21[92];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LM:1;
      uint64_t WZL:1;
      uint64_t reservedSpace0:6;
      uint64_t TACC:8;
      uint64_t TRWR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HLCR;

};

#define OCTOSPI1_CONTROL_REGISTER (*(volatile struct OCTOSPI1_CONTROL_REGISTER_tag *) 0x52005000)

struct OctoSPII_O_Manager_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MUXEN:1;
      uint64_t reservedSpace0:15;
      uint64_t REQ2ACK_TIME:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKEN:1;
      uint64_t CLKSRC:1;
      uint64_t reservedSpace0:2;
      uint64_t DQSEN:1;
      uint64_t DQSSRC:1;
      uint64_t reservedSpace1:2;
      uint64_t NCSEN:1;
      uint64_t NCSSRC:1;
      uint64_t reservedSpace2:6;
      uint64_t IOLEN:1;
      uint64_t IOLSRC:2;
      uint64_t reservedSpace3:5;
      uint64_t IOHEN:1;
      uint64_t IOHSRC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKEN:1;
      uint64_t CLKSRC:1;
      uint64_t reservedSpace0:2;
      uint64_t DQSEN:1;
      uint64_t DQSSRC:1;
      uint64_t reservedSpace1:2;
      uint64_t NCSEN:1;
      uint64_t NCSSRC:1;
      uint64_t reservedSpace2:6;
      uint64_t IOLEN:1;
      uint64_t IOLSRC:2;
      uint64_t reservedSpace3:5;
      uint64_t IOHEN:1;
      uint64_t IOHSRC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P2CR;

};

#define OctoSPII_O_Manager (*(volatile struct OctoSPII_O_Manager_tag *) 0x5200b400)

